{
  "characters": {
    "Banjo & Kazooie": 0,
    "Bayonetta": 1,
    "Bowser": 2,
    "Bowser Jr.": 3,
    "Byleth": 4,
    "Captain Falcon": 5,
    "Chrom": 6,
    "Cloud": 7,
    "Corrin": 8,
    "Daisy": 9,
    "Dark Pit": 10,
    "Dark Samus": 11,
    "Diddy Kong": 12,
    "Donkey Kong": 13,
    "Dr. Mario": 14,
    "Duck Hunt": 15,
    "Falco": 16,
    "Fox": 17,
    "Ganondorf": 18,
    "Greninja": 19,
    "Hero": 20,
    "Ice Climbers": 21,
    "Ike": 22,
    "Incineroar": 23,
    "Inkling": 24,
    "Isabelle": 25,
    "Jigglypuff": 26,
    "Joker": 27,
    "Kazuya": 28,
    "Ken": 29,
    "King Dedede": 30,
    "King K. Rool": 31,
    "Kirby": 32,
    "Link": 33,
    "Little Mac": 34,
    "Lucario": 35,
    "Lucas": 36,
    "Lucina": 37,
    "Luigi": 38,
    "Mario": 39,
    "Marth": 40,
    "Mega Man": 41,
    "Meta Knight": 42,
    "Mewtwo": 43,
    "Mii Brawler": 44,
    "Mii Gunner": 45,
    "Mii Swordfighter": 46,
    "Min Min": 47,
    "Mr. Game & Watch": 48,
    "Ness": 49,
    "Olimar": 50,
    "Pac-Man": 51,
    "Palutena": 52,
    "Peach": 53,
    "Pichu": 54,
    "Pikachu": 55,
    "Piranha Plant": 56,
    "Pit": 57,
    "Pokémon Trainer": 58,
    "Pyra / Mythra": 59,
    "R.O.B.": 60,
    "Richter": 61,
    "Ridley": 62,
    "Robin": 63,
    "Rosalina & Luma": 64,
    "Roy": 65,
    "Ryu": 66,
    "Samus": 67,
    "Sephiroth": 68,
    "Sheik": 69,
    "Shulk": 70,
    "Simon": 71,
    "Snake": 72,
    "Sonic": 73,
    "Sora": 74,
    "Steve": 75,
    "Terry": 76,
    "Toon Link": 77,
    "Villager": 78,
    "Wario": 79,
    "Wii Fit Trainer": 80,
    "Wolf": 81,
    "Yoshi": 82,
    "Young Link": 83,
    "Zelda": 84,
    "Zero Suit Samus": 85
  },
  "stages": {
    "Battlefield": 0,
    "Final Destination": 1,
    "Hollow Bastion": 2,
    "Kalos Pokémon League": 3,
    "Pokémon Stadium 2": 4,
    "Small Battlefield": 5,
    "Smashville": 6,
    "Town and City": 7
  },
  "moves": {
    "Jab": 0,
    "Ftilt": 1,
    "Utilt": 2,
    "Dtilt": 3,
    "Dash Attack": 4,
    "Fsmash": 5,
    "Usmash": 6,
    "Dsmash": 7,
    "Nair": 8,
    "Fair": 9,
    "Bair": 10,
    "Uair": 11,
    "Dair": 12,
    "Neutral B": 13,
    "Side B": 14,
    "Up B": 15,
    "Down B": 16,
    "Forward Throw": 17,
    "Back Throw": 18,
    "Up Throw": 19,
    "Down Throw": 20,
    "Item Throw": 21,
    "Command Input": 22,
    "Other": 23
  },
  "scene_tags": {
    "Combo KO": 0,
    "Zero-to-death": 1,
    "Edgeguarding": 2,
    "One-turn kill": 3,
    "KO race": 4,
    "Close-range": 5,
    "Ledge trapping": 6,
    "Landing punish": 7,
    "Neutral": 8,
    "Read": 9,
    "Whiff punish": 10,
    "Approach": 11,
    "Trade": 12,
    "Trap": 13,
    "Mash": 14,
    "Punish": 15,
    "Notable commentary": 16,
    "Funny moment": 17,
    "Player cam": 18,
    "Misplay": 19
  }
}